Revit 2026 API

# ElectricalSystemTrueLoadPhaseB Property

---

The TrueLoadPhaseB value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TrueLoadPhaseB { get; }
```
```vb
Public ReadOnly Property TrueLoadPhaseB As Double
	Get
```
```cpp
public:
property double TrueLoadPhaseB {
	double get ();
}
```
```fsharp
member TrueLoadPhaseB : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the TrueLoadPhaseB value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace